Config = {}
-- Config.ServerEventName = 'sv:add:reward2'


----------------------  UPDATE ปรับสีวง ---------------------

-------------------------------------------------------
Config.zone = {
    -- { ['x'] = 217.06559, ['y']= 3256.5539, ['z'] 41.747642},
    -- { ['x'] = 294.45843,  ['y'] = 3045.4648, ['z'] 41.262607},

    -- { x = 294.45834, y = 3045.4648, z = 41.264636}

    { ['x'] = 294.45834, ['y'] = 3045.4648, ['z'] = 41.264636},

    -- vector3(212.43122, 3267.0476, 41.480682)


    -- { ['x'] = -201.99, ['y'] =-690.70, ['z'] = 33.94}

}

Config.r = 255  
Config.g = 0
Config.b = 0

Config.size  = 20  --- ขนาดรัศมีวง 

Config.ZoneView = true--เปิดปิด เตือนเข้าวงมั้ย *** ถ้าปิดตรงนี้วื่งน้อยลงครึ่งนึง
Config.Marker = true -- เปิดวง ในเกมส์
----------------------  UPDATE ปรับสีวง ---------------------
Config.r = 255  
Config.g = 0
Config.b = 0

Config.Text = true -- เปิดปิดข้อความมั้ย
Config.Textname = '🍲🍲  AFK-Zone 🍲🍲 '
Config.Position = 0.40 -- ตำแหน่งข้อความ แนวนอน
Config.Position2 = 0.05 -- ตำแหน่งข้อความ2 แนวตั้ง


Config.God =false  -- เป็นอมตะมั้ย ขณะอยุ่ในโซน

--==========================================
--============     ฟังก์ชั่นต่างๆ  ============-
--===========================================
Config.DisableFight = true  --- ปิดการต่อสู้ในวงมั้ย
-- Config.DeleteVehicles = true -- ลบรถที่เข้าวงมั้ย
Config.unarmed = true